garyPenhook/PIC-Assembler/device_includes/pic16f17555.inc
// Register: SCANTRIG
#define SCANTRIG SCANTRIG
SCANTRIG                                 equ 01C99h
// bitfield definitions
SCANTRIG_TSEL_POSN                       equ 0000h
SCANTRIG_TSEL_POSITION                   equ 0000h
SCANTRIG_TSEL_SIZE                       equ 0004h
SCANTRIG_TSEL_LENGTH                     equ 0004h
SCANTRIG_TSEL_MASK                       equ 000Fh

// Register: CRCDATAL
#define CRCDATAL CRCDATAL
CRCDATAL                                 equ 01C9Ah
// bitfield definitions
CRCDATAL_DATA_POSN                       equ 0000h
CRCDATAL_DATA_POSITION                   equ 0000h
CRCDATAL_DATA_SIZE                       equ 0008h
CRCDATAL_DATA_LENGTH                     equ 0008h
CRCDATAL_DATA_MASK                       equ 00FFh
CRCDATAL_DATA0_POSN                      equ 0000h
CRCDATAL_DATA0_POSITION                  equ 0000h
CRCDATAL_DATA0_SIZE                      equ 0001h
CRCDATAL_DATA0_LENGTH                    equ 0001h
CRCDATAL_DATA0_MASK                      equ 0001h
CRCDATAL_DATA1_POSN                      equ 0001h
CRCDATAL_DATA1_POSITION                  equ 0001h
CRCDATAL_DATA1_SIZE                      equ 0001h
CRCDATAL_DATA1_LENGTH                    equ 0001h
CRCDATAL_DATA1_MASK                      equ 0002h
CRCDATAL_DATA2_POSN                      equ 0002h
CRCDATAL_DATA2_POSITION                  equ 0002h
CRCDATAL_DATA2_SIZE                      equ 0001h
CRCDATAL_DATA2_LENGTH                    equ 0001h
CRCDATAL_DATA2_MASK                      equ 0004h
CRCDATAL_DATA3_POSN                      equ 0003h
CRCDATAL_DATA3_POSITION                  equ 0003h
CRCDATAL_DATA3_SIZE                      equ 0001h
CRCDATAL_DATA3_LENGTH                    equ 0001h
CRCDATAL_DATA3_MASK                      equ 0008h
CRCDATAL_DATA4_POSN                      equ 0004h
CRCDATAL_DATA4_POSITION                  equ 0004h
CRCDATAL_DATA4_SIZE                      equ 0001h
CRCDATAL_DATA4_LENGTH                    equ 0001h
CRCDATAL_DATA4_MASK                      equ 0010h
CRCDATAL_DATA5_POSN                      equ 0005h
CRCDATAL_DATA5_POSITION                  equ 0005h
CRCDATAL_DATA5_SIZE                      equ 0001h
CRCDATAL_DATA5_LENGTH                    equ 0001h
CRCDATAL_DATA5_MASK                      equ 0020h
CRCDATAL_DATA6_POSN                      equ 0006h
CRCDATAL_DATA6_POSITION                  equ 0006h
CRCDATAL_DATA6_SIZE                      equ 0001h
CRCDATAL_DATA6_LENGTH                    equ 0001h
CRCDATAL_DATA6_MASK                      equ 0040h
CRCDATAL_DATA7_POSN                      equ 0007h
CRCDATAL_DATA7_POSITION                  equ 0007h
CRCDATAL_DATA7_SIZE                      equ 0001h
CRCDATAL_DATA7_LENGTH                    equ 0001h
CRCDATAL_DATA7_MASK                      equ 0080h

// Register: CRCDATAH
#define CRCDATAH CRCDATAH
CRCDATAH                                 equ 01C9Bh
// bitfield definitions
CRCDATAH_DATA_POSN                       equ 0000h
CRCDATAH_DATA_POSITION                   equ 0000h
CRCDATAH_DATA_SIZE                       equ 0008h
CRCDATAH_DATA_LENGTH                     equ 0008h
CRCDATAH_DATA_MASK                       equ 00FFh
CRCDATAH_DATA8_POSN                      equ 0000h
CRCDATAH_DATA8_POSITION                  equ 0000h
CRCDATAH_DATA8_SIZE                      equ 0001h
CRCDATAH_DATA8_LENGTH                    equ 0001h
CRCDATAH_DATA8_MASK                      equ 0001h
CRCDATAH_DATA9_POSN                      equ 0001h
CRCDATAH_DATA9_POSITION                  equ 0001h
CRCDATAH_DATA9_SIZE                      equ 0001h
CRCDATAH_DATA9_LENGTH                    equ 0001h
CRCDATAH_DATA9_MASK                      equ 0002h
CRCDATAH_DATA10_POSN                     equ 0002h
CRCDATAH_DATA10_POSITION                 equ 0002h
CRCDATAH_DATA10_SIZE                     equ 0001h
CRCDATAH_DATA10_LENGTH                   equ 0001h
CRCDATAH_DATA10_MASK                     equ 0004h
CRCDATAH_DATA11_POSN                     equ 0003h
CRCDATAH_DATA11_POSITION                 equ 0003h
CRCDATAH_DATA11_SIZE                     equ 0001h
CRCDATAH_DATA11_LENGTH                   equ 0001h
CRCDATAH_DATA11_MASK                     equ 0008h
CRCDATAH_DATA12_POSN                     equ 0004h
CRCDATAH_DATA12_POSITION                 equ 0004h
CRCDATAH_DATA12_SIZE                     equ 0001h
CRCDATAH_DATA12_LENGTH                   equ 0001h
CRCDATAH_DATA12_MASK                     equ 0010h
CRCDATAH_DATA13_POSN                     equ 0005h
CRCDATAH_DATA13_POSITION                 equ 0005h
CRCDATAH_DATA13_SIZE                     equ 0001h
CRCDATAH_DATA13_LENGTH                   equ 0001h
CRCDATAH_DATA13_MASK                     equ 0020h
CRCDATAH_DATA14_POSN                     equ 0006h
CRCDATAH_DATA14_POSITION                 equ 0006h
CRCDATAH_DATA14_SIZE                     equ 0001h
CRCDATAH_DATA14_LENGTH                   equ 0001h
CRCDATAH_DATA14_MASK                     equ 0040h
CRCDATAH_DATA15_POSN                     equ 0007h
CRCDATAH_DATA15_POSITION                 equ 0007h
CRCDATAH_DATA15_SIZE                     equ 0001h
CRCDATAH_DATA15_LENGTH                   equ 0001h
CRCDATAH_DATA15_MASK                     equ 0080h

// Register: CRCDATAU
#define CRCDATAU CRCDATAU
CRCDATAU                                 equ 01C9Ch
// bitfield definitions
CRCDATAU_DATA_POSN                       equ 0000h
CRCDATAU_DATA_POSITION                   equ 0000h
CRCDATAU_DATA_SIZE                       equ 0008h
CRCDATAU_DATA_LENGTH                     equ 0008h
CRCDATAU_DATA_MASK                       equ 00FFh
CRCDATAU_DATA16_POSN                     equ 0000h
CRCDATAU_DATA16_POSITION                 equ 0000h
CRCDATAU_DATA16_SIZE                     equ 0001h
CRCDATAU_DATA16_LENGTH                   equ 0001h
CRCDATAU_DATA16_MASK                     equ 0001h
CRCDATAU_DATA17_POSN                     equ 0001h
CRCDATAU_DATA17_POSITION                 equ 0001h
CRCDATAU_DATA17_SIZE                     equ 0001h
CRCDATAU_DATA17_LENGTH                   equ 0001h
CRCDATAU_DATA17_MASK                     equ 0002h
CRCDATAU_DATA18_POSN                     equ 0002h
CRCDATAU_DATA18_POSITION                 equ 0002h
CRCDATAU_DATA18_SIZE                     equ 0001h
CRCDATAU_DATA18_LENGTH                   equ 0001h
CRCDATAU_DATA18_MASK                     equ 0004h
CRCDATAU_DATA19_POSN                     equ 0003h
CRCDATAU_DATA19_POSITION                 equ 0003h
CRCDATAU_DATA19_SIZE                     equ 0001h
CRCDATAU_DATA19_LENGTH                   equ 0001h
CRCDATAU_DATA19_MASK                     equ 0008h
CRCDATAU_DATA20_POSN                     equ 0004h
CRCDATAU_DATA20_POSITION                 equ 0004h
CRCDATAU_DATA20_SIZE                     equ 0001h
CRCDATAU_DATA20_LENGTH                   equ 0001h
CRCDATAU_DATA20_MASK                     equ 0010h
CRCDATAU_DATA21_POSN                     equ 0005h
CRCDATAU_DATA21_POSITION                 equ 0005h
CRCDATAU_DATA21_SIZE                     equ 0001h
CRCDATAU_DATA21_LENGTH                   equ 0001h
CRCDATAU_DATA21_MASK                     equ 0020h
CRCDATAU_DATA22_POSN                     equ 0006h
CRCDATAU_DATA22_POSITION                 equ 0006h
CRCDATAU_DATA22_SIZE                     equ 0001h
CRCDATAU_DATA22_LENGTH                   equ 0001h
CRCDATAU_DATA22_MASK                     equ 0040h
CRCDATAU_DATA23_POSN                     equ 0007h
CRCDATAU_DATA23_POSITION                 equ 0007h
CRCDATAU_DATA23_SIZE                     equ 0001h
CRCDATAU_DATA23_LENGTH                   equ 0001h
CRCDATAU_DATA23_MASK                     equ 0080h

// Register: CRCDATAT
#define CRCDATAT CRCDATAT
CRCDATAT                                 equ 01C9Dh
// bitfield definitions
CRCDATAT_DATA_POSN                       equ 0000h
CRCDATAT_DATA_POSITION                   equ 0000h
CRCDATAT_DATA_SIZE                       equ 0008h
CRCDATAT_DATA_LENGTH                     equ 0008h
CRCDATAT_DATA_MASK                       equ 00FFh
CRCDATAT_DATA24_POSN                     equ 0000h
CRCDATAT_DATA24_POSITION                 equ 0000h
CRCDATAT_DATA24_SIZE                     equ 0001h
CRCDATAT_DATA24_LENGTH                   equ 0001h
CRCDATAT_DATA24_MASK                     equ 0001h
CRCDATAT_DATA25_POSN                     equ 0001h
CRCDATAT_DATA25_POSITION                 equ 0001h
CRCDATAT_DATA25_SIZE                     equ 0001h
CRCDATAT_DATA25_LENGTH                   equ 0001h
CRCDATAT_DATA25_MASK                     equ 0002h
CRCDATAT_DATA26_POSN                     equ 0002h
CRCDATAT_DATA26_POSITION                 equ 0002h
CRCDATAT_DATA26_SIZE                     equ 0001h
CRCDATAT_DATA26_LENGTH                   equ 0001h
CRCDATAT_DATA26_MASK                     equ 0004h
CRCDATAT_DATA27_POSN                     equ 0003h
CRCDATAT_DATA27_POSITION                 equ 0003h
CRCDATAT_DATA27_SIZE                     equ 0001h
CRCDATAT_DATA27_LENGTH                   equ 0001h
CRCDATAT_DATA27_MASK                     equ 0008h
CRCDATAT_DATA28_POSN                     equ 0004h
CRCDATAT_DATA28_POSITION                 equ 0004h
CRCDATAT_DATA28_SIZE                     equ 0001h
CRCDATAT_DATA28_LENGTH                   equ 0001h
CRCDATAT_DATA28_MASK                     equ 0010h
CRCDATAT_DATA29_POSN                     equ 0005h
CRCDATAT_DATA29_POSITION                 equ 0005h
CRCDATAT_DATA29_SIZE                     equ 0001h
CRCDATAT_DATA29_LENGTH                   equ 0001h
CRCDATAT_DATA29_MASK                     equ 0020h
CRCDATAT_DATA30_POSN                     equ 0006h
CRCDATAT_DATA30_POSITION                 equ 0006h
CRCDATAT_DATA30_SIZE                     equ 0001h
CRCDATAT_DATA30_LENGTH                   equ 0001h
CRCDATAT_DATA30_MASK                     equ 0040h
CRCDATAT_DATA31_POSN                     equ 0007h
CRCDATAT_DATA31_POSITION                 equ 0007h
CRCDATAT_DATA31_SIZE                     equ 0001h
CRCDATAT_DATA31_LENGTH                   equ 0001h
CRCDATAT_DATA31_MASK                     equ 0080h

